Revit 2024 API
ModelPath.CentralServerPath Property
 The path to the location of the central Revit server or cloud.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public string CentralServerPath { get; }
Visual Basic
Public ReadOnly Property CentralServerPath As String
	Get
Visual C++
public:
property String^ CentralServerPath {
	String^ get ();
}
See Also
ModelPath Class
Autodesk.Revit.DB Namespace